In [12]:
import pandas as pd 
import numpy as np

In [13]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [15]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [16]:
dates = pd.date_range("20130101", periods=6)

In [17]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
hochul = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [20]:
np.random.randn(6, 4)

array([[ 1.60371226, -0.12831897,  0.93672906,  0.53049537],
       [-0.58019749, -1.1805118 , -0.24686625, -0.68402221],
       [ 1.17429181, -0.10285337,  1.19702238, -0.11029494],
       [ 1.90334314, -0.5490459 ,  0.96601463, -0.60056641],
       [-1.37257523, -1.71231907, -0.22434361, -0.8476096 ],
       [-1.59766085, -1.20516711,  0.96820835,  1.36308038]])

In [21]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [22]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [23]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [24]:
df.head()

                   A         B         C         D
2013-01-01  0.416007  0.807380  1.437466  0.148003
2013-01-02  0.044088  0.584370  0.019388  0.071823
2013-01-03  0.692920  0.678584  0.681631  1.228232
2013-01-04  0.951679 -1.332224 -0.221228  0.125918
2013-01-05 -0.975896  0.231300 -0.562077 -2.454183

In [25]:
df.head()

                   A         B         C         D
2013-01-01  0.416007  0.807380  1.437466  0.148003
2013-01-02  0.044088  0.584370  0.019388  0.071823
2013-01-03  0.692920  0.678584  0.681631  1.228232
2013-01-04  0.951679 -1.332224 -0.221228  0.125918
2013-01-05 -0.975896  0.231300 -0.562077 -2.454183

In [28]:
df.tail()

                   A         B         C         D
2013-01-02  0.044088  0.584370  0.019388  0.071823
2013-01-03  0.692920  0.678584  0.681631  1.228232
2013-01-04  0.951679 -1.332224 -0.221228  0.125918
2013-01-05 -0.975896  0.231300 -0.562077 -2.454183
2013-01-06  1.337023 -0.202776  0.229928 -0.887423

In [29]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [30]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [31]:
df.to_numpy()

array([[ 0.41600731,  0.80738029,  1.43746567,  0.14800339],
       [ 0.04408772,  0.58437033,  0.01938811,  0.07182258],
       [ 0.69291966,  0.67858356,  0.68163106,  1.2282323 ],
       [ 0.95167851, -1.33222421, -0.22122808,  0.12591769],
       [-0.97589573,  0.2313004 , -0.56207734, -2.45418292],
       [ 1.33702269, -0.20277566,  0.22992777, -0.88742259]])

In [32]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.410970  0.127772  0.264185 -0.294605
std    0.810859  0.803158  0.711377  1.252298
min   -0.975896 -1.332224 -0.562077 -2.454183
25%    0.137068 -0.094257 -0.161074 -0.647611
50%    0.554463  0.407835  0.124658  0.098870
75%    0.886989  0.655030  0.568705  0.142482
max    1.337023  0.807380  1.437466  1.228232

In [33]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.416007    0.044088    0.692920    0.951679   -0.975896    1.337023
B    0.807380    0.584370    0.678584   -1.332224    0.231300   -0.202776
C    1.437466    0.019388    0.681631   -0.221228   -0.562077    0.229928
D    0.148003    0.071823    1.228232    0.125918   -2.454183   -0.887423

In [34]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.148003  1.437466  0.807380  0.416007
2013-01-02  0.071823  0.019388  0.584370  0.044088
2013-01-03  1.228232  0.681631  0.678584  0.692920
2013-01-04  0.125918 -0.221228 -1.332224  0.951679
2013-01-05 -2.454183 -0.562077  0.231300 -0.975896
2013-01-06 -0.887423  0.229928 -0.202776  1.337023

In [35]:
df['A']

2013-01-01    0.416007
2013-01-02    0.044088
2013-01-03    0.692920
2013-01-04    0.951679
2013-01-05   -0.975896
2013-01-06    1.337023
Freq: D, Name: A, dtype: float64

In [36]:
df[0:3]

                   A         B         C         D
2013-01-01  0.416007  0.807380  1.437466  0.148003
2013-01-02  0.044088  0.584370  0.019388  0.071823
2013-01-03  0.692920  0.678584  0.681631  1.228232

In [40]:
df.loc[dates[5]]

A    1.337023
B   -0.202776
C    0.229928
D   -0.887423
Name: 2013-01-06 00:00:00, dtype: float64

In [45]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.951679 -1.332224
2013-01-05 -0.975896  0.231300

In [46]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.044088  0.019388
2013-01-03  0.692920  0.681631
2013-01-05 -0.975896 -0.562077

In [47]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.416007  0.807380  1.437466  0.148003
2013-01-02  0.044088  0.584370  0.019388  0.071823
2013-01-03  0.692920  0.678584  0.681631  1.228232
2013-01-04  0.951679 -1.332224 -0.221228  0.125918
2013-01-06  1.337023 -0.202776  0.229928 -0.887423

In [51]:
df2[df2['E'] != 'test']

     A          B    C  D      E    F
1  1.0 2013-01-02  1.0  3  train  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [52]:
df2 = df.copy()

In [54]:
df2

                   A         B         C         D
2013-01-01  0.416007  0.807380  1.437466  0.148003
2013-01-02  0.044088  0.584370  0.019388  0.071823
2013-01-03  0.692920  0.678584  0.681631  1.228232
2013-01-04  0.951679 -1.332224 -0.221228  0.125918
2013-01-05 -0.975896  0.231300 -0.562077 -2.454183
2013-01-06  1.337023 -0.202776  0.229928 -0.887423

In [55]:
df = pd.read_excel("Book1.xlsx", encoding="EUC-KR")

In [57]:
df.head()

  테스트컬럼1  테스트컬럼2  테스트컬럼3
0    송진영      32     169
1    김태권      60     170
2    신호철      60     170

In [58]:
df.columns

Index(['테스트컬럼1', '테스트컬럼2', '테스트컬럼3'], dtype='object')

In [59]:
df['테스트컬럼1']

0    송진영
1    김태권
2    신호철
Name: 테스트컬럼1, dtype: object